## 30904_김진완_0819

In [21]:
import pandas as pd

In [22]:
df = pd.DataFrame({'name':['김지홍','이유진','박동현','김민지'],
                  'english':[90,80,60,70],
                  'math':[50,60,100,20]})
df

  name  english  math
0  김지홍       90    50
1  이유진       80    60
2  박동현       60   100
3  김민지       70    20

In [23]:
df['english']

0    90
1    80
2    60
3    70
Name: english, dtype: int64

In [24]:
df['math']

0     50
1     60
2    100
3     20
Name: math, dtype: int64

In [25]:
sum(df['english'])

300

In [26]:
sum(df['math'])

230

In [27]:
print(sum(df['math']/4))
print(sum(df['english']/4))

57.5
75.0

In [30]:
df_exam = pd.read_excel('excel_exam.xlsx')
df_exam

    id  nclass  math  english  science
0    1       1    50       98       50
1    2       1    60       97       60
2    3       1    45       86       78
3    4       1    30       98       58
4    5       2    25       80       65
5    6       2    50       89       98
6    7       2    80       90       45
7    8       2    90       78       25
8    9       3    20       98       15
9   10       3    50       98       45
10  11       3    65       65       65
11  12       3    45       85       32
12  13       4    46       98       65
13  14       4    48       87       12
14  15       4    75       56       78
15  16       4    58       98       65
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

In [31]:
print('영어점수 합계',sum(df_exam['english']))
print('영어점수 평균',sum(df_exam['english'])/20)

영어점수 합계 1698
영어점수 평균 84.9

In [32]:
print('수학점수 합계',sum(df_exam['math']))
print('수학점수 평균',sum(df_exam['math'])/20)

수학점수 합계 1149
수학점수 평균 57.45

In [33]:
print('과학점수 합계',sum(df_exam['science']))
print('과학점수 평균',sum(df_exam['science'])/20)

과학점수 합계 1189
과학점수 평균 59.45

In [34]:
df = pd.DataFrame({'제품':['사과','딸기','수박'],
                  '가격':[1800,1500,3000],
                  '판매량':[24,38,13]})
df

   제품    가격  판매량
0  사과  1800   24
1  딸기  1500   38
2  수박  3000   13

In [44]:
print('가격의 평균',sum(df['가격']/len(sales)))
print('판매량의 평균',sum(df['판매량']/len(sales)))

가격의 평균 2100.0
판매량의 평균 24.999999999999996

In [38]:
sales = pd.DataFrame({'fruit':['사과','딸기','수박'],
                  'price':[1800,1500,3000],
                  'volume':[24,38,13]})
sales

  fruit  price  volume
0    사과   1800      24
1    딸기   1500      38
2    수박   3000      13

In [41]:
x = [1,2,3,4,5]
x

[1, 2, 3, 4, 5]

In [42]:
len(x)

5

In [45]:
len(df_exam)

20

In [46]:
print('과학점수 합계',sum(df_exam['science']))
print('과학점수 평균',sum(df_exam['science'])/len(df_exam))
print('수학점수 합계',sum(df_exam['math']))
print('수학점수 평균',sum(df_exam['math'])/len(df_exam))
print('영어점수 합계',sum(df_exam['english']))
print('영어점수 평균',sum(df_exam['english'])/len(df_exam))

과학점수 합계 1189
과학점수 평균 59.45
수학점수 합계 1149
수학점수 평균 57.45
영어점수 합계 1698
영어점수 평균 84.9

In [50]:
df_exam_novar = pd.read_excel('excel_exam_novar.xlsx', header = None)
df_exam_novar

   0  1   2   3   4
0  1  1  50  98  50
1  2  1  60  97  60
2  3  2  25  80  65
3  4  2  50  89  98
4  5  3  20  98  15
5  6  3  50  98  45
6  7  4  46  98  65
7  8  4  48  87  12